IDEA StatiCa Open Model
CheckResSummary.CheckStatus Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Status of check
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool CheckStatus { get; set; }
Public Property CheckStatus As Boolean
	Get
	Set
public:
property bool CheckStatus {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
CheckResSummary Class
IdeaRS.OpenModel.Connection Namespace